renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx261/register_access/ccrx/iodefine.h
#define	MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12AD	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_GPTW	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW0	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW1	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW2	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW3	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW4	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW5	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW6	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW7	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_POEG	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_RSCI0	SYSTEM.MSTPCRB.BIT.MSTPB31
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_USB0	SYSTEM.MSTPCRB.BIT.MSTPB19
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_CMPB	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_ELC	SYSTEM.MSTPCRB.BIT.MSTPB9
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_REMC0	SYSTEM.MSTPCRC.BIT.MSTPC29
#define	MSTP_RSCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_RSCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_CAC	SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_RAM	SYSTEM.MSTPCRC.BIT.MSTPC0
#define	MSTP_RSIP	SYSTEM.MSTPCRD.BIT.MSTPD31
#define	MSTP_CTSU	SYSTEM.MSTPCRD.BIT.MSTPD10
#define	MSTP_CANFD0	SYSTEM.MSTPCRD.BIT.MSTPD9

#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	BSC		(*(volatile struct st_bsc    __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac    __evenaccess *)0x8B000)
#define	CANFD	(*(volatile struct st_canfd  __evenaccess *)0xA8014)
#define	CANFD0	(*(volatile struct st_canfd0 __evenaccess *)0xA8000)
#define	CMPB	(*(volatile struct st_cmpb   __evenaccess *)0x8C580)
#define	CMT		(*(volatile struct st_cmt    __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0   __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0   __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0   __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0   __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc    __evenaccess *)0x88280)
#define	CTSU	(*(volatile struct st_ctsu   __evenaccess *)0xA0700)
#define	DA		(*(volatile struct st_da     __evenaccess *)0x880C0)
#define	DMAC	(*(volatile struct st_dmac   __evenaccess *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0  __evenaccess *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1  __evenaccess *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1  __evenaccess *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1  __evenaccess *)0x820C0)
#define	DOC		(*(volatile struct st_doc    __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc    __evenaccess *)0x82400)
#define	ELC		(*(volatile struct st_elc    __evenaccess *)0x8B100)
#define	FLASH	(*(volatile struct st_flash  __evenaccess *)0x7FC090)
#define	GPTW	(*(volatile struct st_gptw   __evenaccess *)0xC2B00)
#define	GPTW0	(*(volatile struct st_gptw0  __evenaccess *)0xC2000)
#define	GPTW1	(*(volatile struct st_gptw1  __evenaccess *)0xC2100)
#define	GPTW2	(*(volatile struct st_gptw1  __evenaccess *)0xC2200)
#define	GPTW3	(*(volatile struct st_gptw3  __evenaccess *)0xC2300)
#define	GPTW4	(*(volatile struct st_gptw3  __evenaccess *)0xC2400)
#define	GPTW5	(*(volatile struct st_gptw3  __evenaccess *)0xC2500)
#define	GPTW6	(*(volatile struct st_gptw6  __evenaccess *)0xC2600)
#define	GPTW7	(*(volatile struct st_gptw6  __evenaccess *)0xC2700)
#define	ICU		(*(volatile struct st_icu    __evenaccess *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt   __evenaccess *)0x88030)
#define	LPT		(*(volatile struct st_lpt    __evenaccess *)0x800B0)
#define	MPC		(*(volatile struct st_mpc    __evenaccess *)0x8C11F)
#define	MPU		(*(volatile struct st_mpu    __evenaccess *)0x86400)
#define	OFSM	(*(volatile struct st_ofsm   __evenaccess *)0xFFFFFF80)
#define	POEG	(*(volatile struct st_poeg   __evenaccess *)0x9E000)
#define	PORT	(*(volatile struct st_port   __evenaccess *)0x8C120)
#define	PORT0	(*(volatile struct st_port0  __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1  __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2  __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3  __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4  __evenaccess *)0x8C004)
#define	PORT5	(*(volatile struct st_port5  __evenaccess *)0x8C005)
#define	PORTA	(*(volatile struct st_porta  __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb  __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc  __evenaccess *)0x8C00C)
#define	PORTD	(*(volatile struct st_portd  __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte  __evenaccess *)0x8C00E)
#define	PORTG	(*(volatile struct st_portg  __evenaccess *)0x8C010)
#define	PORTH	(*(volatile struct st_porth  __evenaccess *)0x8C011)
#define	PORTJ	(*(volatile struct st_portj  __evenaccess *)0x8C012)
#define	RAM		(*(volatile struct st_ram    __evenaccess *)0x81200)
#define	REMC0	(*(volatile struct st_remc   __evenaccess *)0xA0B00)
#define	RIIC0	(*(volatile struct st_riic   __evenaccess *)0x88300)
#define	RSCI0	(*(volatile struct st_rsci0  __evenaccess *)0xA1000)
#define	RSCI8	(*(volatile struct st_rsci0  __evenaccess *)0xA1400)
#define	RSCI9	(*(volatile struct st_rsci9  __evenaccess *)0xA1480)
#define	RSPI0	(*(volatile struct st_rspi   __evenaccess *)0x88380)
#define	RTC		(*(volatile struct st_rtc    __evenaccess *)0x8C400)
#define	RTCB	(*(volatile struct st_rtcb   __evenaccess *)0x8C402)
#define	S12AD	(*(volatile struct st_s12ad  __evenaccess *)0x89000)
#define	SCI1	(*(volatile struct st_sci1   __evenaccess *)0x8A020)
#define	SCI5	(*(volatile struct st_sci1   __evenaccess *)0x8A0A0)
#define	SCI6	(*(volatile struct st_sci1   __evenaccess *)0x8A0C0)
#define	SCI12	(*(volatile struct st_sci12  __evenaccess *)0x8B300)
#define	SMCI1	(*(volatile struct st_smci   __evenaccess *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci   __evenaccess *)0x8A0A0)
#define	SMCI6	(*(volatile struct st_smci   __evenaccess *)0x8A0C0)
#define	SMCI12	(*(volatile struct st_smci   __evenaccess *)0x8B300)
#define	SYSTEM	(*(volatile struct st_system __evenaccess *)0x80000)
#define	TEMPS	(*(volatile struct st_temps  __evenaccess *)0x7FC228)
#define	TMR0	(*(volatile struct st_tmr0   __evenaccess *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1   __evenaccess *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0   __evenaccess *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1   __evenaccess *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01  __evenaccess *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01  __evenaccess *)0x88214)
#define	USB0	(*(volatile struct st_usb    __evenaccess *)0xA0000)
#define	WDT		(*(volatile struct st_wdt    __evenaccess *)0x88020)

typedef enum enum_ir {
IR_BSC_BUSERR=16,IR_RAM_RAMERR=18,
IR_FCU_FRDYI=23,
IR_ICU_SWINT=27,
IR_CMT0_CMI0,IR_CMT1_CMI1,
IR_CMT2_CMI2,IR_CMT3_CMI3,
IR_CAC_FERRF,IR_CAC_MENDF,IR_CAC_OVFF,
IR_USB0_D0FIFO0=36,IR_USB0_D1FIFO0,IR_USB0_USBI0,
IR_POEG_POEGGAI=40,IR_POEG_POEGGBI,IR_POEG_POEGGCI,IR_POEG_POEGGDI,
IR_RSPI0_SPEI0,IR_RSPI0_SPRI0,IR_RSPI0_SPTI0,IR_RSPI0_SPII0,
IR_DOC_DOPCF=57,
IR_CMPB_CMPB0,IR_CMPB_CMPB1,
IR_CTSU_CTSUWR,IR_CTSU_CTSURD,IR_CTSU_CTSUFN,
IR_RTC_CUP,
IR_ICU_IRQ0,IR_ICU_IRQ1,IR_ICU_IRQ2,IR_ICU_IRQ3,IR_ICU_IRQ4,IR_ICU_IRQ5,IR_ICU_IRQ6,IR_ICU_IRQ7,
IR_ELC_ELSR8I=80,
IR_SYSTEM_SNZI,
IR_LVD_LVD1=88,IR_LVD_LVD2,
IR_USB0_USBR0,
IR_RTC_ALM=92,IR_RTC_PRD,
IR_REMC0_REMCI0,
IR_S12AD_S12ADI0=102,IR_S12AD_GBADI,
IR_ELC_ELSR18I=106,IR_ELC_ELSR19I,
IR_GPTW0_GTCIA0,IR_GPTW0_GTCIB0,IR_GPTW0_GTCIC0,IR_GPTW0_GTCID0,IR_GPTW0_GTCIE0,IR_GPTW0_GTCIF0,IR_GPTW0_GTCIV0,IR_GPTW0_GTCIU0,
IR_GPTW1_GTCIA1,IR_GPTW1_GTCIB1,IR_GPTW1_GTCIC1,IR_GPTW1_GTCID1,IR_GPTW1_GTCIE1,IR_GPTW1_GTCIF1,IR_GPTW1_GTCIV1,IR_GPTW1_GTCIU1,
IR_GPTW2_GTCIA2,IR_GPTW2_GTCIB2,IR_GPTW2_GTCIC2,IR_GPTW2_GTCID2,IR_GPTW2_GTCIE2,IR_GPTW2_GTCIF2,IR_GPTW2_GTCIV2,IR_GPTW2_GTCIU2,
IR_GPTW3_GTCIA3,IR_GPTW3_GTCIB3,IR_GPTW3_GTCIC3,IR_GPTW3_GTCID3,IR_GPTW3_GTCIE3,IR_GPTW3_GTCIF3,IR_GPTW3_GTCIV3,IR_GPTW3_GTCIU3,
IR_GPTW4_GTCIA4,IR_GPTW4_GTCIB4,IR_GPTW4_GTCIC4,IR_GPTW4_GTCID4,IR_GPTW4_GTCIE4,IR_GPTW4_GTCIF4,IR_GPTW4_GTCIV4,IR_GPTW4_GTCIU4,
IR_GPTW5_GTCIA5,IR_GPTW5_GTCIB5,IR_GPTW5_GTCIC5,IR_GPTW5_GTCID5,IR_GPTW5_GTCIE5,IR_GPTW5_GTCIF5,IR_GPTW5_GTCIV5,IR_GPTW5_GTCIU5,
IR_GPTW6_GTCIA6,IR_GPTW6_GTCIB6,IR_GPTW6_GTCIC6,IR_GPTW6_GTCID6,IR_GPTW6_GTCIE6,IR_GPTW6_GTCIF6,IR_GPTW6_GTCIV6,IR_GPTW6_GTCIU6,
IR_GPTW7_GTCIA7,IR_GPTW7_GTCIB7,IR_GPTW7_GTCIC7,IR_GPTW7_GTCID7,IR_GPTW7_GTCIE7,IR_GPTW7_GTCIF7,IR_GPTW7_GTCIV7,IR_GPTW7_GTCIU7,
IR_TMR0_CMIA0=174,IR_TMR0_CMIB0,IR_TMR0_OVI0,
IR_TMR1_CMIA1,IR_TMR1_CMIB1,IR_TMR1_OVI1,
IR_TMR2_CMIA2,IR_TMR2_CMIB2,IR_TMR2_OVI2,
IR_TMR3_CMIA3,IR_TMR3_CMIB3,IR_TMR3_OVI3,
IR_CANFD_RFRI,IR_CANFD_GLEI,IR_CANFD_RMRI,IR_CANFD_RFDREQ0,IR_CANFD_RFDREQ1,IR_CANFD_EC1EI,IR_CANFD_EC2EI,IR_CANFD_ECOVI,
IR_CANFD0_CHTI,IR_CANFD0_CHEI,IR_CANFD0_CFRI,IR_CANFD0_CFDREQ0,
IR_DMAC_DMAC0I,IR_DMAC_DMAC1I,IR_DMAC_DMAC2I,IR_DMAC_DMAC3I,
IR_RSIP_PROC_BUSY,IR_RSIP_ROMOK,IR_RSIP_LONG_PLG,IR_RSIP_TEST_BUSY,IR_RSIP_WRRDY0,
IR_RSIP_WRRDY2,IR_RSIP_RDRDY0,IR_RSIP_INTEGRATE_RDRDY,IR_RSIP_INTEGRATE_WRRDY,IR_RSIP_ECCERR,
IR_RSCI9_BFD,IR_RSCI9_AED,
IR_RSCI0_ERI,IR_RSCI0_RXI,IR_RSCI0_TXI,IR_RSCI0_TEI,
IR_SCI1_ERI1,IR_SCI1_RXI1,IR_SCI1_TXI1,IR_SCI1_TEI1,
IR_SCI5_ERI5,IR_SCI5_RXI5,IR_SCI5_TXI5,IR_SCI5_TEI5,
IR_SCI6_ERI6,IR_SCI6_RXI6,IR_SCI6_TXI6,IR_SCI6_TEI6,
IR_RSCI8_ERI,IR_RSCI8_RXI,IR_RSCI8_TXI,IR_RSCI8_TEI,
IR_RSCI9_ERI,IR_RSCI9_RXI,IR_RSCI9_TXI,IR_RSCI9_TEI,
IR_SCI12_ERI12,IR_SCI12_RXI12,IR_SCI12_TXI12,IR_SCI12_TEI12,IR_SCI12_SCIX0,IR_SCI12_SCIX1,IR_SCI12_SCIX2,IR_SCI12_SCIX3,
IR_RIIC0_EEI0,IR_RIIC0_RXI0,IR_RIIC0_TXI0,IR_RIIC0_TEI0,
IR_LPT_LPTCMI1=255
} enum_ir_t;

