renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx261/register_access/ccrx/iodefine.h
typedef struct st_canfd {
	union {
		unsigned long LONG;
		struct {
			unsigned long ITP:16;
			unsigned long :3;
			unsigned long TSCS:1;
			unsigned long TSP:4;
			unsigned long :2;
			unsigned long OMRC:1;
			unsigned long DLLCS:1;
			unsigned long MME:1;
			unsigned long DRE:1;
			unsigned long DCE:1;
			unsigned long TPRI:1;
		} BIT;
	} GCFG;
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long TSCR:1;
			unsigned long :4;
			unsigned long POIE:1;
			unsigned long THLIE:1;
			unsigned long MLIE:1;
			unsigned long DEIE:1;
			unsigned long :5;
			unsigned long SLPRQ:1;
			unsigned long MDC:2;
		} BIT;
	} GCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long RAMST:1;
			unsigned long SLPST:1;
			unsigned long HLTST:1;
			unsigned long RSTST:1;
		} BIT;
	} GSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :15;
			unsigned long EEDF0:1;
			unsigned long :12;
			unsigned long PODF:1;
			unsigned long THLDF:1;
			unsigned long MLDF:1;
			unsigned long DEDF:1;
		} BIT;
	} GESR;
	unsigned long  TSCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long AFLWE:1;
			unsigned long :7;
			unsigned long PAGE:1;
		} BIT;
	} AFCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :10;
			unsigned long RN0:6;
			unsigned long :16;
		} BIT;
	} AFCFG;
	union {
		unsigned long LONG;
		struct {
			unsigned long :21;
			unsigned long PLS:3;
			unsigned long :2;
			unsigned long NMB:6;
		} BIT;
	} RMCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long NDF:32;
		} BIT;
	} RMNDR;
	union {
		unsigned long LONG;
		struct {
			unsigned long RMIE31:1;
			unsigned long RMIE30:1;
			unsigned long RMIE29:1;
			unsigned long RMIE28:1;
			unsigned long RMIE27:1;
			unsigned long RMIE26:1;
			unsigned long RMIE25:1;
			unsigned long RMIE24:1;
			unsigned long RMIE23:1;
			unsigned long RMIE22:1;
			unsigned long RMIE21:1;
			unsigned long RMIE20:1;
			unsigned long RMIE19:1;
			unsigned long RMIE18:1;
			unsigned long RMIE17:1;
			unsigned long RMIE16:1;
			unsigned long RMIE15:1;
			unsigned long RMIE14:1;
			unsigned long RMIE13:1;
			unsigned long RMIE12:1;
			unsigned long RMIE11:1;
			unsigned long RMIE10:1;
			unsigned long RMIE9:1;
			unsigned long RMIE8:1;
			unsigned long RMIE7:1;
			unsigned long RMIE6:1;
			unsigned long RMIE5:1;
			unsigned long RMIE4:1;
			unsigned long RMIE3:1;
			unsigned long RMIE2:1;
			unsigned long RMIE1:1;
			unsigned long RMIE0:1;
		} BIT;
	} RMIER;
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long RFITH:3;
			unsigned long RFIM:1;
			unsigned long :1;
			unsigned long FDS:3;
			unsigned long :1;
			unsigned long PLS:3;
			unsigned long :2;
			unsigned long RFIE:1;
			unsigned long RFE:1;
		} BIT;
	} RFCR[2];
	union {
		unsigned long LONG;
		struct {
			unsigned long :18;
			unsigned long FLVL:6;
			unsigned long :4;
			unsigned long RFIF:1;
			unsigned long LOST:1;
			unsigned long FULL:1;
			unsigned long EMPTY:1;
		} BIT;
	} RFSR[2];
	unsigned long  RFPCR[2];
	union {
		unsigned long LONG;
		struct {
			unsigned long TINT:8;
			unsigned long FDS:3;
			unsigned long :3;
			unsigned long LTM:2;
			unsigned long CFITH:3;
			unsigned long CFIM:1;
			unsigned long ITR:1;
			unsigned long ITCS:1;
			unsigned long :1;
			unsigned long MODE:1;
			unsigned long :1;
			unsigned long PLS:3;
			unsigned long :1;
			unsigned long CFTIE:1;
			unsigned long CFRIE:1;
			unsigned long CFE:1;
		} BIT;
	} CFCR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :18;
			unsigned long FLVL:6;
			unsigned long :3;
			unsigned long CFTIF:1;
			unsigned long CFRIF:1;
			unsigned long LOST:1;
			unsigned long FULL:1;
			unsigned long EMPTY:1;
		} BIT;
	} CFSR0;
	unsigned long  CFPCR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long CFEMP0:1;
			unsigned long :6;
			unsigned long RFEMP1:1;
			unsigned long RFEMP0:1;
		} BIT;
	} FESR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long CFFUL0:1;
			unsigned long :6;
			unsigned long RFFUL1:1;
			unsigned long RFFUL0:1;
		} BIT;
	} FFSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long CFML0:1;
			unsigned long :6;
			unsigned long RFML1:1;
			unsigned long RFML0:1;
		} BIT;
	} FMLSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :30;
			unsigned long RFIF1:1;
			unsigned long RFIF0:1;
		} BIT;
	} RFISR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char ONESHOT:1;
			unsigned char TARQ:1;
			unsigned char TXRQ:1;
		} BIT;
	} TMCR[4];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char TARQS:1;
			unsigned char TXRQS:1;
			unsigned char TXRF:2;
			unsigned char TXSF:1;
		} BIT;
	} TMSR[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long TXRQS3:1;
			unsigned long TXRQS2:1;
			unsigned long TXRQS1:1;
			unsigned long TXRQS0:1;
		} BIT;
	} TMTRSR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long TARQS3:1;
			unsigned long TARQS2:1;
			unsigned long TARQS1:1;
			unsigned long TARQS0:1;
		} BIT;
	} TMARSR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long TXCF3:1;
			unsigned long TXCF2:1;
			unsigned long TXCF1:1;
			unsigned long TXCF0:1;
		} BIT;
	} TMTCSR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long TAF3:1;
			unsigned long TAF2:1;
			unsigned long TAF1:1;
			unsigned long TAF0:1;
		} BIT;
	} TMTASR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long TMIE3:1;
			unsigned long TMIE2:1;
			unsigned long TMIE1:1;
			unsigned long TMIE0:1;
		} BIT;
	} TMIER0;
	char           wk0[24];
	union {
		unsigned long LONG;
		struct {
			unsigned long :27;
			unsigned long THIF0:1;
			unsigned long CFTIF0:1;
			unsigned long TQIF0:1;
			unsigned long TAIF0:1;
			unsigned long TSIF0:1;
		} BIT;
	} TISR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :12;
			unsigned long RTPS:4;
			unsigned long :16;
		} BIT;
	} GTMCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :29;
			unsigned long RTME:1;
			unsigned long :2;
		} BIT;
	} GTMER;
	union {
		unsigned long LONG;
		struct {
			unsigned long :22;
			unsigned long TSCPS:2;
			unsigned long :7;
			unsigned long PXEDIS:1;
		} BIT;
	} GFDCFG;
	char           wk1[4];
	unsigned long  GTMLKR;
	char           wk2[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :27;
			unsigned long IGES:5;
		} BIT;
	} AFIGSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long KEY:8;
			unsigned long :7;
			unsigned long IGEE:1;
		} BIT;
	} AFIGER;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long CFDTE0:1;
			unsigned long :6;
			unsigned long RFDTE1:1;
			unsigned long RFDTE0:1;
		} BIT;
	} DTCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long CFDTS0:1;
			unsigned long :6;
			unsigned long RFDTS1:1;
			unsigned long RFDTS0:1;
		} BIT;
	} DTSR;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long KEY:8;
			unsigned long :7;
			unsigned long SRST:1;
		} BIT;
	} GRCR;
	char           wk4[68];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long LPC:1;
				unsigned long ID:29;
			} BIT;
		} IDR;
		union {
			unsigned long LONG;
			struct {
				unsigned long IDEM:1;
				unsigned long RTRM:1;
				unsigned long IFL1:1;
				unsigned long IDM:29;
			} BIT;
		} MASK;
		union {
			unsigned long LONG;
			struct {
				unsigned long PTR:16;
				unsigned long DMBE:1;
				unsigned long :2;
				unsigned long DMB:5;
				unsigned long IFL0:1;
				unsigned long :3;
				unsigned long DLC:4;
			} BIT;
		} PTR0;
		union {
			unsigned long LONG;
			struct {
				unsigned long :23;
				unsigned long CF0E:1;
				unsigned long :6;
				unsigned long RF1E:1;
				unsigned long RF0E:1;
			} BIT;
		} PTR1;
	} AFL[16];
	char           wk5[96];
	unsigned long  RTPAR[64];
	char           wk6[416];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RFB[2];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long THENT:1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} CFB[1];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long THENT:1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :28;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} TMB[4];
	char           wk7[492];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB0;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB1;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB2;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB3;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB4;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB5;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB6;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB7;
	char           wk8[416];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB8;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB9;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long IDE:1;
				unsigned long RTR:1;
				unsigned long :1;
				unsigned long ID:29;
			} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
