renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx261/register_access/ccrx/iodefine.h
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long DLC:4;
				unsigned long :12;
				unsigned long TS:16;
			} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				unsigned long PTR:16;
				unsigned long :6;
				unsigned long IFL:2;
				unsigned long :5;
				unsigned long FDF:1;
				unsigned long BRS:1;
				unsigned long ESI:1;
			} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB31;
	char           wk11[276608];
	union {
		unsigned long LONG;
		struct {
			unsigned long :14;
			unsigned long EC2EAS:1;
			unsigned long EC1EAS:1;
			unsigned long ECEDWC:2;
			unsigned long :2;
			unsigned long ECOVF:1;
			unsigned long EC2EC:1;
			unsigned long EC1EC:1;
			unsigned long :2;
			unsigned long ECEDE:1;
			unsigned long EC1ECD:1;
			unsigned long EC2EIE:1;
			unsigned long EC1EIE:1;
			unsigned long EC2EF:1;
			unsigned long EC1EF:1;
			unsigned long ECEF:1;
		} BIT;
	} ECCSR;
	union {
		unsigned short WORD;
		struct {
			unsigned short ECTMWC:2;
			unsigned short :6;
			unsigned short ECTME:1;
			unsigned short :5;
			unsigned short ECDIS:1;
			unsigned short :1;
		} BIT;
	} ECTMR;
	char           wk12[6];
	unsigned long  ECTDR;
	unsigned long  ECEAR;
} st_canfd_t;

typedef struct st_canfd0 {
	union {
		unsigned long LONG;
		struct {
			unsigned long TSEG2:7;
			unsigned long TSEG1:8;
			unsigned long SJW:7;
			unsigned long BRP:10;
		} BIT;
	} NBCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long ROME:1;
			unsigned long BFT:1;
			unsigned long :3;
			unsigned long CTMS:2;
			unsigned long CTME:1;
			unsigned long EDM:1;
			unsigned long BOM:2;
			unsigned long :1;
			unsigned long TDCVIE:1;
			unsigned long SCOVIE:1;
			unsigned long ECOVIE:1;
			unsigned long TAIE:1;
			unsigned long ALIE:1;
			unsigned long BLIE:1;
			unsigned long OLIE:1;
			unsigned long BORIE:1;
			unsigned long BOEIE:1;
			unsigned long EPIE:1;
			unsigned long EWIE:1;
			unsigned long BEIE:1;
			unsigned long :4;
			unsigned long RTBO:1;
			unsigned long SLPRQ:1;
			unsigned long MDC:2;
		} BIT;
	} CHCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long TEC:8;
			unsigned long REC:8;
			unsigned long :7;
			unsigned long RESI:1;
			unsigned long CRDY:1;
			unsigned long RECST:1;
			unsigned long TRMST:1;
			unsigned long BOST:1;
			unsigned long EPST:1;
			unsigned long SLPST:1;
			unsigned long HLTST:1;
			unsigned long RSTST:1;
		} BIT;
	} CHSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long CRC15:15;
			unsigned long :1;
			unsigned long ADEDF:1;
			unsigned long B0EDF:1;
			unsigned long B1EDF:1;
			unsigned long CEDF:1;
			unsigned long AEDF:1;
			unsigned long FEDF:1;
			unsigned long SEDF:1;
			unsigned long ALDF:1;
			unsigned long BLDF:1;
			unsigned long OLDF:1;
			unsigned long BORDF:1;
			unsigned long BOEDF:1;
			unsigned long EPDF:1;
			unsigned long EWDF:1;
			unsigned long BEDF:1;
		} BIT;
	} CHESR;
	char           wk0[124];
	union {
		unsigned long LONG;
		struct {
			unsigned long :22;
			unsigned long QDS:2;
			unsigned long TQIM:1;
			unsigned long :1;
			unsigned long TQIE:1;
			unsigned long :4;
			unsigned long TQE:1;
		} BIT;
	} TQCR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :21;
			unsigned long FLVL:3;
			unsigned long :5;
			unsigned long TQIF:1;
			unsigned long FULL:1;
			unsigned long EMPTY:1;
		} BIT;
	} TQSR0;
	unsigned long  TQPCR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :21;
			unsigned long THRC:1;
			unsigned long THIM:1;
			unsigned long THIE:1;
			unsigned long :7;
			unsigned long THE:1;
		} BIT;
	} THCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :20;
			unsigned long FLVL:4;
			unsigned long :4;
			unsigned long THIF:1;
			unsigned long LOST:1;
			unsigned long FULL:1;
			unsigned long EMPTY:1;
		} BIT;
	} THSR;
	unsigned long  THPCR;
	char           wk1[92];
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long SJW:4;
			unsigned long :4;
			unsigned long TSEG2:4;
			unsigned long :3;
			unsigned long TSEG1:5;
			unsigned long BRP:8;
		} BIT;
	} DBCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long CLOE:1;
			unsigned long REFE:1;
			unsigned long FDOE:1;
			unsigned long :4;
			unsigned long TDCO:8;
			unsigned long :5;
			unsigned long TESI:1;
			unsigned long TDCE:1;
			unsigned long SSPC:1;
			unsigned long :5;
			unsigned long ECC:3;
		} BIT;
	} FDCFG;
	union {
		unsigned long LONG;
		struct {
			unsigned long :30;
			unsigned long SCCL:1;
			unsigned long ECCL:1;
		} BIT;
	} FDCTR;
	union {
		unsigned long LONG;
		struct {
			unsigned long SC:8;
			unsigned long EC:8;
			unsigned long TDCV:1;
			unsigned long :5;
			unsigned long SCOV:1;
			unsigned long ECOV:1;
			unsigned long TDCR:8;
		} BIT;
	} FDSTS;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long SBC:4;
			unsigned long :3;
			unsigned long CRC21:21;
		} BIT;
	} FDCRC;
	char           wk2[1580];
	union {
		unsigned long LONG;
		struct {
			unsigned long TS:16;
			unsigned long :11;
			unsigned long BN:2;
			unsigned long BT:3;
		} BIT;
	} THACR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :14;
			unsigned long IFL:2;
			unsigned long PTR:16;
		} BIT;
	} THACR1;
} st_canfd0_t;

typedef struct st_cmpb {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char CPB1INI:1;
			unsigned char :3;
			unsigned char CPB0INI:1;
		} BIT;
	} CPBCNT1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char CPB1WCP:1;
			unsigned char :3;
			unsigned char CPB0WCP:1;
		} BIT;
	} CPBCNT2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CPB1OUT:1;
			unsigned char :3;
			unsigned char CPB0OUT:1;
			unsigned char :3;
		} BIT;
	} CPBFLG;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char CPB1INTPL:1;
			unsigned char CPB1INTEG:1;
			unsigned char CPB1INTEN:1;
			unsigned char :1;
			unsigned char CPB0INTPL:1;
			unsigned char CPB0INTEG:1;
			unsigned char CPB0INTEN:1;
		} BIT;
	} CPBINT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CPB1F:2;
			unsigned char :1;
			unsigned char CPB1FEN:1;
			unsigned char CPB0F:2;
			unsigned char :1;
			unsigned char CPB0FEN:1;
		} BIT;
	} CPBF;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char CPBSPDMD:1;
		} BIT;
	} CPBMD;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char CPB1VRF:1;
			unsigned char :3;
			unsigned char CPB0VRF:1;
		} BIT;
	} CPBREF;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char CPB1OP:1;
			unsigned char CPB1OE:1;
			unsigned char :2;
			unsigned char CPB0OP:1;
			unsigned char CPB0OE:1;
		} BIT;
	} CPBOCR;
} st_cmpb_t;

typedef struct st_cmt {
	union {
		unsigned short WORD;
		struct {
			unsigned short :14;
			unsigned short STR1:1;
			unsigned short STR0:1;
		} BIT;
	} CMSTR0;
	char           wk0[14];
	union {
		unsigned short WORD;
		struct {
			unsigned short :14;
			unsigned short STR3:1;
			unsigned short STR2:1;
		} BIT;
	} CMSTR1;
} st_cmt_t;

