renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx261/register_access/ccrx/iodefine.h
typedef struct st_cmt0 {
	union {
		unsigned short WORD;
		struct {
			unsigned short :9;
			unsigned short CMIE:1;
			unsigned short :4;
			unsigned short CKS:2;
		} BIT;
	} CMCR;
	unsigned short CMCNT;
	unsigned short CMCOR;
} st_cmt0_t;

typedef struct st_crc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char DORCLR:1;
			unsigned char :4;
			unsigned char LMS:1;
			unsigned char GPS:2;
		} BIT;
	} CRCCR;
	unsigned char  CRCDIR;
	unsigned short CRCDOR;
} st_crc_t;

typedef struct st_ctsu {
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :31;
			unsigned long CTADCS:1;
		} BIT;
	} CTSUADCC;
	char           wk0[508];
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long DCBACK:1;
			unsigned long DCMODE:1;
			unsigned long STCLK:6;
			unsigned long PCSEL:1;
			unsigned long SDPSEL:1;
			unsigned long POSEL:2;
			unsigned long LOAD:2;
			unsigned long ATUNE2:1;
			unsigned long :1;
			unsigned long MD1:1;
			unsigned long MD0:1;
			unsigned long CLK:2;
			unsigned long ATUNE1:1;
			unsigned long ATUNE0:1;
			unsigned long CSW:1;
			unsigned long PON:1;
			unsigned long TXVSEL:2;
			unsigned long PUMPON:1;
			unsigned long INIT:1;
			unsigned long :1;
			unsigned long SNZ:1;
			unsigned long CAP:1;
			unsigned long STRT:1;
		} BIT;
	} CTSUCRA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :2;
			unsigned long SSCNT:2;
			unsigned long :1;
			unsigned long SSMOD:3;
			unsigned long :8;
			unsigned long SST:8;
			unsigned long PROFF:1;
			unsigned long SOFF:1;
			unsigned long PRMODE:2;
			unsigned long PRRATIO:4;
		} BIT;
	} CTSUCRB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :12;
			unsigned long MCA3:1;
			unsigned long MCA2:1;
			unsigned long MCA1:1;
			unsigned long MCA0:1;
			unsigned long :2;
			unsigned long MCH1:6;
			unsigned long :2;
			unsigned long MCH0:6;
		} BIT;
	} CTSUMCH;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long CHAC31:1;
			unsigned long CHAC30:1;
			unsigned long CHAC29:1;
			unsigned long CHAC28:1;
			unsigned long CHAC27:1;
			unsigned long CHAC26:1;
			unsigned long CHAC25:1;
			unsigned long CHAC24:1;
			unsigned long CHAC23:1;
			unsigned long CHAC22:1;
			unsigned long CHAC21:1;
			unsigned long CHAC20:1;
			unsigned long CHAC19:1;
			unsigned long CHAC18:1;
			unsigned long CHAC17:1;
			unsigned long CHAC16:1;
			unsigned long CHAC15:1;
			unsigned long CHAC14:1;
			unsigned long CHAC13:1;
			unsigned long CHAC12:1;
			unsigned long CHAC11:1;
			unsigned long CHAC10:1;
			unsigned long CHAC9:1;
			unsigned long CHAC8:1;
			unsigned long CHAC7:1;
			unsigned long CHAC6:1;
			unsigned long CHAC5:1;
			unsigned long CHAC4:1;
			unsigned long CHAC3:1;
			unsigned long CHAC2:1;
			unsigned long CHAC1:1;
			unsigned long CHAC0:1;
		} BIT;
	} CTSUCHACA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :28;
			unsigned long CHAC35:1;
			unsigned long CHAC34:1;
			unsigned long CHAC33:1;
			unsigned long CHAC32:1;
		} BIT;
	} CTSUCHACB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long CHTRC31:1;
			unsigned long CHTRC30:1;
			unsigned long CHTRC29:1;
			unsigned long CHTRC28:1;
			unsigned long CHTRC27:1;
			unsigned long CHTRC26:1;
			unsigned long CHTRC25:1;
			unsigned long CHTRC24:1;
			unsigned long CHTRC23:1;
			unsigned long CHTRC22:1;
			unsigned long CHTRC21:1;
			unsigned long CHTRC20:1;
			unsigned long CHTRC19:1;
			unsigned long CHTRC18:1;
			unsigned long CHTRC17:1;
			unsigned long CHTRC16:1;
			unsigned long CHTRC15:1;
			unsigned long CHTRC14:1;
			unsigned long CHTRC13:1;
			unsigned long CHTRC12:1;
			unsigned long CHTRC11:1;
			unsigned long CHTRC10:1;
			unsigned long CHTRC9:1;
			unsigned long CHTRC8:1;
			unsigned long CHTRC7:1;
			unsigned long CHTRC6:1;
			unsigned long CHTRC5:1;
			unsigned long CHTRC4:1;
			unsigned long CHTRC3:1;
			unsigned long CHTRC2:1;
			unsigned long CHTRC1:1;
			unsigned long CHTRC0:1;
		} BIT;
	} CTSUCHTRCA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :28;
			unsigned long CHTRC35:1;
			unsigned long CHTRC34:1;
			unsigned long CHTRC33:1;
			unsigned long CHTRC32:1;
		} BIT;
	} CTSUCHTRCB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :16;
			unsigned long PS:1;
			unsigned long UCOVF:1;
			unsigned long SCOVF:1;
			unsigned long DTSR:1;
			unsigned long :1;
			unsigned long STC:3;
			unsigned long ICOMP0:1;
			unsigned long ICOMP1:1;
			unsigned long ICOMPRST:1;
			unsigned long :3;
			unsigned long MFC:2;
		} BIT;
	} CTSUSR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long SDPA:8;
			unsigned long SSDIV:4;
			unsigned long :2;
			unsigned long SNUM:8;
			unsigned long SO:10;
		} BIT;
	} CTSUSO;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long UC:16;
			unsigned long SC:16;
		} BIT;
	} CTSUSCNT;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long TXREV:1;
			unsigned long CCOCALIB:1;
			unsigned long CCOCLK:1;
			unsigned long DACCLK:1;
			unsigned long SUCARRY:1;
			unsigned long SUMSEL:1;
			unsigned long DACCARRY:1;
			unsigned long DACMSEL:1;
			unsigned long :11;
			unsigned long IOCSEL:1;
			unsigned long DCOFF:1;
			unsigned long :1;
			unsigned long IOC:1;
			unsigned long CNTRDSEL:1;
			unsigned long TSOC:1;
			unsigned long SUCLKEN:1;
			unsigned long CLKSEL:2;
			unsigned long DRV:1;
			unsigned long TSOD:1;
			unsigned long :2;
		} BIT;
	} CTSUCALIB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long SUMULTI1:8;
			unsigned long SUADJ1:8;
			unsigned long SUMULTI0:8;
			unsigned long SUADJ0:8;
		} BIT;
	} CTSUSUCLKA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long SUMULTI3:8;
			unsigned long SUADJ3:8;
			unsigned long SUMULTI2:8;
			unsigned long SUADJ2:8;
		} BIT;
	} CTSUSUCLKB;
	char           wk1[12];
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :12;
			unsigned long SCACTB:4;
			unsigned long :7;
			unsigned long AJFEN:1;
			unsigned long :2;
			unsigned long MTUCFEN:1;
			unsigned long DTCLESS:1;
			unsigned long :1;
			unsigned long MAJIRIMD:1;
			unsigned long MCACFEN:1;
			unsigned long CCOCFEN:1;
		} BIT;
	} CTSUOPT;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long SCNTACCOUNT:16;
			unsigned long SCNTACCOEFF:16;
		} BIT;
	} CTSUSCNTACT;
	char           wk2[4];
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long OFFSETCOEFF1:16;
			unsigned long :6;
			unsigned long SO1:10;
		} BIT;
	} CTSUMCACT1;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long OFFSETCOEFF2:16;
			unsigned long :6;
			unsigned long SO2:10;
		} BIT;
	} CTSUMCACT2;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long OFFSETCOEFF3:16;
			unsigned long :6;
			unsigned long SO3:10;
		} BIT;
	} CTSUMCACT3;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long AJBMAT:4;
			unsigned long AJMMAT:4;
			unsigned long :2;
			unsigned long JC:2;
			unsigned long :3;
			unsigned long BLINI:1;
			unsigned long THOT:8;
			unsigned long TLOT:8;
		} BIT;
	} CTSUAJCR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long AJTHH:16;
			unsigned long AJTHL:16;
		} BIT;
	} CTSUAJTHR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long AJMMAR:27;
			unsigned long :1;
			unsigned long AJMMATI:4;
		} BIT;
	} CTSUAJMMAR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long AJBLACT:32;
		} BIT;
	} CTSUAJBLACT;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long AJBLAR:16;
			unsigned long AJBLAC:16;
		} BIT;
	} CTSUAJBLAR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned long :16;
			unsigned long SJCCR:8;
			unsigned long :3;
			unsigned long FJR:1;
			unsigned long TJR3:1;
			unsigned long TJR2:1;
			unsigned long TJR1:1;
			unsigned long TJR0:1;
		} BIT;
	} CTSUAJRR;
	char           wk3[7715380];
	union {
		unsigned long LONG;
		struct {
			unsigned long TRESULT4:8;
			unsigned long SUADJD:8;
			unsigned long DACTRIM:8;
			unsigned long RTRIM:8;
		} BIT;
	} CTSUTRIMA;
	union {
		unsigned long LONG;
		struct {
			unsigned long TRESULT3:8;
			unsigned long TRESULT2:8;
			unsigned long TRESULT1:8;
			unsigned long TRESULT0:8;
		} BIT;
	} CTSUTRIMB;
} st_ctsu_t;

typedef struct st_da {
	unsigned short DADR0;
	unsigned short DADR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DAOE1:1;
			unsigned char DAOE0:1;
			unsigned char :6;
		} BIT;
	} DACR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DPSEL:1;
			unsigned char :7;
		} BIT;
	} DADPR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DAADST:1;
			unsigned char :7;
		} BIT;
	} DAADSCR;
} st_da_t;

