renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx261/register_access/ccrx/iodefine.h
typedef struct st_flash {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DFLEN:1;
		} BIT;
	} DFLCTL;
	char           wk0[111];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char FMS1:1;
			unsigned char RPDIS:1;
			unsigned char :1;
			unsigned char FMS0:1;
			unsigned char :1;
		} BIT;
	} FPMCR;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char EXS:1;
		} BIT;
	} FASR;
	char           wk2[3];
	unsigned short FSARL;
	char           wk3[6];
	unsigned short FSARH;
	char           wk4[2];
	union {
		unsigned char BYTE;
		struct {
			unsigned char OPST:1;
			unsigned char STOP:1;
			unsigned char :2;
			unsigned char CMD:4;
		} BIT;
	} FCR;
	char           wk5[3];
	unsigned short FEARL;
	char           wk6[6];
	unsigned short FEARH;
	char           wk7[2];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char FRESET:1;
		} BIT;
	} FRESETR;
	char           wk8[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char EILGLERR:1;
			unsigned char ILGLERR:1;
			unsigned char BCERR:1;
			unsigned char :1;
			unsigned char PRGERR:1;
			unsigned char ERERR:1;
		} BIT;
	} FSTATR0;
	char           wk9[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char EXRDY:1;
			unsigned char FRDY:1;
			unsigned char :6;
		} BIT;
	} FSTATR1;
	char           wk10[3];
	unsigned short FWB0;
	char           wk11[6];
	unsigned short FWB1;
	char           wk12[6];
	unsigned short FWB2;
	char           wk13[2];
	unsigned short FWB3;
	char           wk14[58];
	unsigned char  FPR;
	char           wk15[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char PERR:1;
		} BIT;
	} FPSR;
	char           wk16[59];
	union {
		unsigned short WORD;
		struct {
			unsigned short :1;
			unsigned short AWPR:1;
			unsigned short :5;
			unsigned short SASMF:1;
			unsigned short :8;
		} BIT;
	} FSCMR;
	char           wk17[6];
	unsigned short FAWSMR;
	char           wk18[6];
	unsigned short FAWEMR;
	char           wk19[6];
	union {
		unsigned char BYTE;
		struct {
			unsigned char SAS:2;
			unsigned char PCKA:6;
		} BIT;
	} FISR;
	char           wk20[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char OPST:1;
			unsigned char :4;
			unsigned char CMD:3;
		} BIT;
	} FEXCR;
	char           wk21[3];
	unsigned short FEAML;
	char           wk22[6];
	unsigned short FEAMH;
	char           wk23[358];
	unsigned long  UIDR0;
	unsigned long  UIDR1;
	unsigned long  UIDR2;
	unsigned long  UIDR3;
	char           wk24[15440];
	union {
		unsigned short WORD;
		struct {
			unsigned short FEKEY:8;
			unsigned short FENTRYD:1;
			unsigned short :6;
			unsigned short FENTRY0:1;
		} BIT;
	} FENTRYR;
	char           wk25[14];
	union {
		unsigned short WORD;
		struct {
			unsigned short MEKEY:8;
			unsigned short :7;
			unsigned short MEMWAIT:1;
		} BIT;
	} MEMWAITR;
} st_flash_t;

typedef struct st_gptw {
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCS:2;
			unsigned long NFEN:1;
			unsigned long :2;
			unsigned long GODF:1;
			unsigned long GRP:2;
			unsigned long :2;
			unsigned long ALIGN:1;
			unsigned long RV:1;
			unsigned long INV:1;
			unsigned long N:1;
			unsigned long P:1;
			unsigned long FB:1;
			unsigned long :7;
			unsigned long EN:1;
			unsigned long :1;
			unsigned long W:1;
			unsigned long V:1;
			unsigned long U:1;
			unsigned long :1;
			unsigned long WF:1;
			unsigned long VF:1;
			unsigned long UF:1;
		} BIT;
	} OPSCR;
} st_gptw_t;

typedef struct st_gptw0 {
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long PRKEY:8;
			unsigned long :3;
			unsigned long CMNWP:1;
			unsigned long CLRWP:1;
			unsigned long STPWP:1;
			unsigned long STRWP:1;
			unsigned long WP:1;
		} BIT;
	} GTWP;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CSTRT7:1;
			unsigned long CSTRT6:1;
			unsigned long CSTRT5:1;
			unsigned long CSTRT4:1;
			unsigned long CSTRT3:1;
			unsigned long CSTRT2:1;
			unsigned long CSTRT1:1;
			unsigned long CSTRT0:1;
		} BIT;
	} GTSTR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CSTOP7:1;
			unsigned long CSTOP6:1;
			unsigned long CSTOP5:1;
			unsigned long CSTOP4:1;
			unsigned long CSTOP3:1;
			unsigned long CSTOP2:1;
			unsigned long CSTOP1:1;
			unsigned long CSTOP0:1;
		} BIT;
	} GTSTP;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CCLR7:1;
			unsigned long CCLR6:1;
			unsigned long CCLR5:1;
			unsigned long CCLR4:1;
			unsigned long CCLR3:1;
			unsigned long CCLR2:1;
			unsigned long CCLR1:1;
			unsigned long CCLR0:1;
		} BIT;
	} GTCLR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSTRT:1;
			unsigned long :7;
			unsigned long SSELCH:1;
			unsigned long SSELCG:1;
			unsigned long SSELCF:1;
			unsigned long SSELCE:1;
			unsigned long SSELCD:1;
			unsigned long SSELCC:1;
			unsigned long SSELCB:1;
			unsigned long SSELCA:1;
			unsigned long SSCBFAH:1;
			unsigned long SSCBFAL:1;
			unsigned long SSCBRAH:1;
			unsigned long SSCBRAL:1;
			unsigned long SSCAFBH:1;
			unsigned long SSCAFBL:1;
			unsigned long SSCARBH:1;
			unsigned long SSCARBL:1;
			unsigned long SSGTRGDF:1;
			unsigned long SSGTRGDR:1;
			unsigned long SSGTRGCF:1;
			unsigned long SSGTRGCR:1;
			unsigned long SSGTRGBF:1;
			unsigned long SSGTRGBR:1;
			unsigned long SSGTRGAF:1;
			unsigned long SSGTRGAR:1;
		} BIT;
	} GTSSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSTOP:1;
			unsigned long :7;
			unsigned long PSELCH:1;
			unsigned long PSELCG:1;
			unsigned long PSELCF:1;
			unsigned long PSELCE:1;
			unsigned long PSELCD:1;
			unsigned long PSELCC:1;
			unsigned long PSELCB:1;
			unsigned long PSELCA:1;
			unsigned long PSCBFAH:1;
			unsigned long PSCBFAL:1;
			unsigned long PSCBRAH:1;
			unsigned long PSCBRAL:1;
			unsigned long PSCAFBH:1;
			unsigned long PSCAFBL:1;
			unsigned long PSCARBH:1;
			unsigned long PSCARBL:1;
			unsigned long PSGTRGDF:1;
			unsigned long PSGTRGDR:1;
			unsigned long PSGTRGCF:1;
			unsigned long PSGTRGCR:1;
			unsigned long PSGTRGBF:1;
			unsigned long PSGTRGBR:1;
			unsigned long PSGTRGAF:1;
			unsigned long PSGTRGAR:1;
		} BIT;
	} GTPSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CCLR:1;
			unsigned long :3;
			unsigned long CP1CCE:1;
			unsigned long CSCMSC:3;
			unsigned long CSELCH:1;
			unsigned long CSELCG:1;
			unsigned long CSELCF:1;
			unsigned long CSELCE:1;
			unsigned long CSELCD:1;
			unsigned long CSELCC:1;
			unsigned long CSELCB:1;
			unsigned long CSELCA:1;
			unsigned long CSCBFAH:1;
			unsigned long CSCBFAL:1;
			unsigned long CSCBRAH:1;
			unsigned long CSCBRAL:1;
			unsigned long CSCAFBH:1;
			unsigned long CSCAFBL:1;
			unsigned long CSCARBH:1;
			unsigned long CSCARBL:1;
			unsigned long CSGTRGDF:1;
			unsigned long CSGTRGDR:1;
			unsigned long CSGTRGCF:1;
			unsigned long CSGTRGCR:1;
			unsigned long CSGTRGBF:1;
			unsigned long CSGTRGBR:1;
			unsigned long CSGTRGAF:1;
			unsigned long CSGTRGAR:1;
		} BIT;
	} GTCSR;
	char           wk0[8];
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long ASOC:1;
			unsigned long ASELCH:1;
			unsigned long ASELCG:1;
			unsigned long ASELCF:1;
			unsigned long ASELCE:1;
			unsigned long ASELCD:1;
			unsigned long ASELCC:1;
			unsigned long ASELCB:1;
			unsigned long ASELCA:1;
			unsigned long ASCBFAH:1;
			unsigned long ASCBFAL:1;
			unsigned long ASCBRAH:1;
			unsigned long ASCBRAL:1;
			unsigned long ASCAFBH:1;
			unsigned long ASCAFBL:1;
			unsigned long ASCARBH:1;
			unsigned long ASCARBL:1;
			unsigned long ASGTRGDF:1;
			unsigned long ASGTRGDR:1;
			unsigned long ASGTRGCF:1;
			unsigned long ASGTRGCR:1;
			unsigned long ASGTRGBF:1;
			unsigned long ASGTRGBR:1;
			unsigned long ASGTRGAF:1;
			unsigned long ASGTRGAR:1;
		} BIT;
	} GTICASR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long BSOC:1;
			unsigned long BSELCH:1;
			unsigned long BSELCG:1;
			unsigned long BSELCF:1;
			unsigned long BSELCE:1;
			unsigned long BSELCD:1;
			unsigned long BSELCC:1;
			unsigned long BSELCB:1;
			unsigned long BSELCA:1;
			unsigned long BSCBFAH:1;
			unsigned long BSCBFAL:1;
			unsigned long BSCBRAH:1;
			unsigned long BSCBRAL:1;
			unsigned long BSCAFBH:1;
			unsigned long BSCAFBL:1;
			unsigned long BSCARBH:1;
			unsigned long BSCARBL:1;
			unsigned long BSGTRGDF:1;
			unsigned long BSGTRGDR:1;
			unsigned long BSGTRGCF:1;
			unsigned long BSGTRGCR:1;
			unsigned long BSGTRGBF:1;
			unsigned long BSGTRGBR:1;
			unsigned long BSGTRGAF:1;
			unsigned long BSGTRGAR:1;
		} BIT;
	} GTICBSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long CKEG:2;
			unsigned long TPCS:4;
			unsigned long :3;
			unsigned long MD:4;
			unsigned long SSCEN:1;
			unsigned long :3;
			unsigned long SSCGRP:2;
			unsigned long SCGTIOC:1;
			unsigned long ICDS:1;
			unsigned long :7;
			unsigned long CST:1;
		} BIT;
	} GTCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long OBDTYR:1;
			unsigned long OBDTYF:1;
			unsigned long OBDTY:2;
			unsigned long :4;
			unsigned long OADTYR:1;
			unsigned long OADTYF:1;
			unsigned long OADTY:2;
			unsigned long :14;
			unsigned long UDF:1;
			unsigned long UD:1;
		} BIT;
	} GTUDDTYC;
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCSB:2;
			unsigned long NFBEN:1;
			unsigned long :1;
			unsigned long OBEOCD:1;
			unsigned long OBDF:2;
			unsigned long OBE:1;
			unsigned long OBHLD:1;
			unsigned long OBDFLT:1;
			unsigned long :1;
			unsigned long GTIOB:5;
			unsigned long NFCSA:2;
			unsigned long NFAEN:1;
			unsigned long PSYE:1;
			unsigned long OAEOCD:1;
			unsigned long OADF:2;
			unsigned long OAE:1;
			unsigned long OAHLD:1;
			unsigned long OADFLT:1;
			unsigned long CPSCIR:1;
			unsigned long GTIOA:5;
		} BIT;
	} GTIOR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long GRPABL:1;
			unsigned long GRPABH:1;
			unsigned long :3;
			unsigned long GRP:2;
			unsigned long :4;
			unsigned long ADTRBDEN:1;
			unsigned long ADTRBUEN:1;
			unsigned long ADTRADEN:1;
			unsigned long ADTRAUEN:1;
			unsigned long SCFPU:1;
			unsigned long SCFPO:1;
			unsigned long SCFF:1;
			unsigned long SCFE:1;
			unsigned long SCFD:1;
			unsigned long SCFC:1;
			unsigned long SCFB:1;
			unsigned long SCFA:1;
			unsigned long GTINTPR:2;
			unsigned long GTINTF:1;
			unsigned long GTINTE:1;
			unsigned long GTINTD:1;
			unsigned long GTINTC:1;
			unsigned long GTINTB:1;
			unsigned long GTINTA:1;
		} BIT;
	} GTINTAD;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long OABLF:1;
			unsigned long OABHF:1;
			unsigned long :4;
			unsigned long ODF:1;
			unsigned long :4;
			unsigned long ADTRBDF:1;
			unsigned long ADTRBUF:1;
			unsigned long ADTRADF:1;
			unsigned long ADTRAUF:1;
			unsigned long TUCF:1;
			unsigned long :4;
			unsigned long ITCNT:3;
			unsigned long TCFPU:1;
			unsigned long TCFPO:1;
			unsigned long TCFF:1;
			unsigned long TCFE:1;
			unsigned long TCFD:1;
			unsigned long TCFC:1;
			unsigned long TCFB:1;
			unsigned long TCFA:1;
		} BIT;
	} GTST;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long ADTDB:1;
			unsigned long ADTTB:2;
			unsigned long :1;
			unsigned long ADTDA:1;
			unsigned long ADTTA:2;
			unsigned long :1;
			unsigned long CCRSWT:1;
			unsigned long PR:2;
			unsigned long CCRB:2;
			unsigned long CCRA:2;
			unsigned long :13;
			unsigned long BD:3;
		} BIT;
	} GTBER;
	union {
		unsigned long LONG;
		struct {
			unsigned long :17;
			unsigned long ADTBL:1;
			unsigned long :1;
			unsigned long ADTAL:1;
			unsigned long :1;
			unsigned long IVTT:3;
			unsigned long IVTC:2;
			unsigned long ITLF:1;
			unsigned long ITLE:1;
			unsigned long ITLD:1;
			unsigned long ITLC:1;
			unsigned long ITLB:1;
			unsigned long ITLA:1;
		} BIT;
	} GTITC;
	unsigned long  GTCNT;
	unsigned long  GTCCRA;
	unsigned long  GTCCRB;
	unsigned long  GTCCRC;
	unsigned long  GTCCRE;
	unsigned long  GTCCRD;
	unsigned long  GTCCRF;
	unsigned long  GTPR;
	unsigned long  GTPBR;
	unsigned long  GTPDBR;
	unsigned long  GTADTRA;
	unsigned long  GTADTBRA;
	unsigned long  GTADTDBRA;
	unsigned long  GTADTRB;
	unsigned long  GTADTBRB;
	unsigned long  GTADTDBRB;
	union {
		unsigned long LONG;
		struct {
			unsigned long :31;
			unsigned long TDE:1;
		} BIT;
	} GTDTCR;
	unsigned long  GTDVU;
	char           wk1[64];
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long SECSEL7:1;
			unsigned long SECSEL6:1;
			unsigned long SECSEL5:1;
			unsigned long SECSEL4:1;
			unsigned long SECSEL3:1;
			unsigned long SECSEL2:1;
			unsigned long SECSEL1:1;
			unsigned long SECSEL0:1;
		} BIT;
	} GTSECSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :6;
			unsigned long SSCD:1;
			unsigned long :7;
			unsigned long SSCE:1;
			unsigned long :6;
			unsigned long SBDAD:1;
			unsigned long SBDPD:1;
			unsigned long SBDCD:1;
			unsigned long :5;
			unsigned long SBDAE:1;
			unsigned long SBDPE:1;
			unsigned long SBDCE:1;
		} BIT;
	} GTSECR;
	char           wk2[20];
	union {
		unsigned long LONG;
		struct {
			unsigned long ICBGRP:2;
			unsigned long :5;
			unsigned long ICBCLK:1;
			unsigned long ICBFPU:1;
			unsigned long ICBFPO:1;
			unsigned long ICBFF:1;
			unsigned long ICBFE:1;
			unsigned long ICBFD:1;
			unsigned long ICBFC:1;
			unsigned long ICBFB:1;
			unsigned long ICBFA:1;
			unsigned long ICAGRP:2;
			unsigned long :5;
			unsigned long ICACLK:1;
			unsigned long ICAFPU:1;
			unsigned long ICAFPO:1;
			unsigned long ICAFF:1;
			unsigned long ICAFE:1;
			unsigned long ICAFD:1;
			unsigned long ICAFC:1;
			unsigned long ICAFB:1;
			unsigned long ICAFA:1;
		} BIT;
	} GTICCR;
} st_gptw0_t;

